Repository: greedWizard/classroom_backend
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ru

source: You are not participating in this dialog!
ru: Вы не являетесь участником диалога!

source: You can not moderate this room.
ru: Вы не имеете права модерировать эту комнату.

source: You are not allowed to do that.
ru: Доступ запрещён.

source: You are not allowed to perform this operation.
ru: Операция не разрешена

source: This field is required
ru: Это поле обязательно.

source: This room does not exist.
ru: Данной комнаты не существует

source: User is already in this room.
ru: Пользователь уже находится в комнате.

source: Not Found
ru: Не найдено.

source: Permission denied
ru: Отказано в доступе.

source: Can't remove a room host.
ru: Нельзя удалить единственного создателя комнаты.

source: Access denied.
ru: Доступ запрещён.

source: Description should be less than {TITLE_MAX_LENGTH} characters.
ru: Описание должно быть не длиннее {TITLE_MAX_LENGTH} символов.

source: Title should be less than {TITLE_MAX_LENGTH} characters.
ru: Название должно быть не больше {TITLE_MAX_LENGTH} символов

source: Access denied!
ru: Отказано в доступе!

source: You are not participating in this room.
ru: Вы не находитесь в данной комнате.

source: You can't assign the homework.
ru: Вы не можете выкладывать ДЗ на проверку.

source: You are not allowed to do that
ru: Отказано в доступе

source: Can't change status from '{current_status}' to '{status}'.
ru: Нельзя изменить статус с '{current_status}' на '{status}'

source: User with that credits is already registred.
ru: Пользователь с такими данными уже зарегестрирован

source: User not found. He is either inactive or not registred yet.
ru: Пользователь не активен или не зарегестрирован. Если вы регестрировались на портале, пожалуйста проверьте правильность вводимой почты и не забудьте активировать профиль по ссылке в письме. (Письма иногда могут попадать в папку спам).

source: Password should be at least {LENGTH} characters long and contain at least one digit and upper case letter.
ru: Пароль должен содержать минимум {LENGTH} символов, включая одну заглавную букву и одну цифру.

source: Passwords don't match.
ru: Указанные пароли не совпадают.

source: Password is too short.
ru: Пароль слишком короткий.

source: The field should not be empty
ru: Это поле обязательно.

source: Invalid email format.
ru: Неправильный формат электронной почты (должно быть example@example.ru)

source: User with that email is already registred.
ru: Пользователь с такими данными уже существует. Если у вас уже есть аккаут вы можете восстановить пароль на странице входа.

source: Please accept eula and try again.
ru: Пожалуйста примите правила использования и повторите попытку.

source: Invalid phone format.
ru: Неверный формат вводимого номера (пример: +79999999999)

source: User with that phone number is already registred.
ru: Пользователь с таким номером телефона уже существует.

source: Incorrect password
ru: Неправильный пароль.

source: Profile photo must be .png, .jpeg, .jpg
ru: Фото профиля должно быть одного из следующих форматов: .png .jpeg .jpg

source: this field is required
ru: Это поле обязательно

source: User not found or inactive
ru: Пользователь не найден или не активен. Если вы регестрировались на портале, пожалуйста проверьте правильность вводимой почты и не забудьте активировать профиль по ссылке в письме. (Письма иногда могут попадать в папку спам)

source: User not found
ru: Пользователь не найден. Если вы регестрировались на портале, пожалуйста проверьте правильность вводимой почты и не забудьте активировать профиль по ссылке в письме. (Письма иногда могут попадать в папку спам)

source: Token is not provided!
ru: Не передан токен!

source: Wrong token format!
ru: Токен неправильного формата или уже не валидный.

source: There is no user with provided token in need of password reset
ru: Пользователь не запрашивал смену пароля. Если вы видите это сообщение по пошибке, попробуйте запросить смену пароля снова.

source: User with that vk id already exists!
ru: Пользователь с таким VK ID уже существует!

source: The topic does not exist.
ru: Данной темы не существует.
